use arboard::Clipboard;
use regex::Regex;

fn main() {
    let mut clipboard = Clipboard::new().unwrap();

    let text_before = clipboard.get_text().unwrap();

    let corrections = [
        ("вызватьисключение", "ВызватьИсключение"),
        ("возврат", "Возврат"),
        ("выполнить", "Выполнить"),
        ("добавитьобработчик", "ДобавитьОбработчик"),
        ("для", "Для"),
        ("если", "Если"),
        ("знач", "Знач"),
        ("и", "И"),
        ("из", "Из"),
        ("или", "Или"),
        ("иначе", "Иначе"),
        ("иначеесли", "ИначеЕсли"),
        ("исключение", "Исключение"),
        ("истина", "Истина"),
        ("каждого", "Каждого"),
        ("конецесли", "КонецЕсли"),
        ("конецпопытки", "КонецПопытки"),
        ("конецпроцедуры", "КонецПроцедуры"),
        ("конецфункции", "КонецФункции"),
        ("конеццикла", "КонецЦикла"),
        ("не", "Не"),
        ("неопределено", "Неопределено"),
        ("перейти", "Перейти"),
        ("перем", "Перем"),
        ("по", "По"),
        ("пока", "Пока"),
        ("попытка", "Попытка"),
        ("процедура", "Процедура"),
        ("прервать", "Прервать"),
        ("продолжить", "Продолжить"),
        ("тогда", "Тогда"),
        ("цикл", "Цикл"),
        ("удалитьобработчик", "УдалитьОбработчик"),
        ("функция", "Функция"),
        ("экспорт", "Экспорт"),
        ("вебклиент", "ВебКлиент"),
        ("внешнеесоединение", "ВнешнееСоединение"),
        ("клиент", "Клиент"),
        ("мобильноеприложениеклиент", "МобильноеПриложениеКлиент"),
        ("мобильноеприложениесервер", "МобильноеПриложениеСервер"),
        ("мобильныйклиент", "МобильныйКлиент"),
        ("наклиенте", "НаКлиенте"),
        ("насервере", "НаСервере"),
        ("область", "Область"),
        ("конецобласти", "КонецОбласти"),
        ("сервер", "Сервер"),
        (
            "толстыйклиентобычноеприложение",
            "ТолстыйКлиентОбычноеПриложение",
        ),
        (
            "толстыйклиентуправляемоеприложение",
            "ТолстыйКлиентУправляемоеПриложение",
        ),
        ("тонкийклиент", "ТонкийКлиент"),
        (
            "наклиентенасерверебезконтекста",
            "НаКлиентеНаСервереБезКонтекста",
        ),
        ("наклиентенасервере", "НаКлиентеНаСервере"),
    ];

    let mut result = text_before.to_string();

    for (wrong_any_case, correct) in corrections.iter() {
        let pattern = format!(r"(?i)\b{}\b", regex::escape(wrong_any_case));
        let re = Regex::new(&pattern).unwrap();

        result = re.replace_all(&result, *correct).to_string();
    }

    clipboard.set_text(result).unwrap();

}
